{
  "_class_name": "OmnigesFlowTransformerModel",
  "_diffusers_version": "0.31.0.dev0",
  "attention_head_dim": 64,
  "caption_projection_dim": 1536,
  "seq_length": 128,
  "gesture_latent_dim": 512,
  "joint_attention_dim": 4096,
  "num_attention_heads": 24,
  "num_layers": 2,
  "gesture_output_dim": 512,
  "pooled_projection_dim": 2048,
  "pos_embed_max_size": 128,
  "audio_input_dim": 8,
  "add_audio": true,
  "use_audio_mae": false,
  "drop_text": false,
  "drop_gesture": false,
  "drop_audio": false,
  "qk_norm": "layer_norm"
}
